Revit 2026 API

# IFCFileReadOptionsFileName Property

---

The full file name of the IFC file to be read.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FileName { get; set; }
```
```vb
Public Property FileName As String
	Get
	Set
```
```cpp
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FileName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCFileReadOptions Class

Autodesk.Revit.DB.IFC Namespace